#+TITLE: Chairmans Foods Projects

* Projects
** Yield Study
   :LOGBOOK:
   CLOCK: [2017-08-18 Fri 14:33]--[2017-08-18 Fri 17:04] =>  2:31
   CLOCK: [2017-08-18 Fri 11:19]--[2017-08-18 Fri 12:30] =>  1:11
   :END:
*** Queso
**** HEB Classic Queso
***** DONE [2017-09-15 Fri 11:11] HEB Classic Queso
      CLOSED: [2017-09-19 Tue 15:31]
      - CLOSING NOTE [2017-09-19 Tue 15:31]
	Completed boxing on 9/18. Need to make sure Acctng sees the 80 cases from 9/16 pack. It's not included on the 9/18 paperwork. See boxing notes below.
      - Batching (9/15):
	- 2 @1,740 lb
	- Batch #1: 2,100 cups (90.5%)
	- Batch #2: 1,860 cups (80.1%)
	  - Product was 175°. This caused a lot of rework (seals)
	- Total: 3,960 cups (85.3%)
      - Boxing (9/16,18)
	- 353 cases (91.2%)
	- 80 + 34 boxed on Saturday 9/16
	- 34 + 46 + 80 + 80 + 33
	- Total count is missing 


**** HEB Hot Pepper Queso
***** DONE [2017-09-15 Fri 11:05] HEB Hot Pepper Queso
      CLOSED: [2017-09-19 Tue 10:43]
      - CLOSING NOTE [2017-09-19 Tue 10:43] \\
	174 cases (90% yield)
      - Batching (9/14)
	- 1 @1,740 lb
	- Produced 2,128 12 oz cups (91.7%)
	- Dropped 25 cups on the floor
	  - Additional 18.75 lb of product
	  - Would have been 1,614.75 lb of product (92.8%)
      - Boxing (9/15)
	- 174 cases (90%)
	- Lost 40 cups

**** HEB Chorizo with Sausage
***** DONE [2017-09-14 Thu 10:55] HEB Chorizo Queso
      CLOSED: [2017-09-19 Tue 15:59]
      - CLOSING NOTE [2017-09-19 Tue 15:59]
- Batching (9/13):
  - 1 @900 lb
  - Produced 1075 12oz bowls (Yield: 89.5%)
- Boxing (9/14)
  - 87 cases (87% yield)
  - Lost 31 cups. 17 were wasted that leaves 14 "missing"

**** Queso Mama with Sausage
***** DONE [2017-09-19 Tue 10:32] Queso Mama with Sausage
      CLOSED: [2017-10-13 Fri 15:52]
      - CLOSING NOTE [2017-10-13 Fri 15:52] \\
	Completed.
- Batching (9/19)
  - 3 x 1,525
  - No adjustments made to formula
  - Batch #1: 705 cups (92.4% yield)
  - Batch #2: 738 cups (96.7% yield)
  - Batch #3: 756 cups (99.1% yield)
  - Total: 2,203 cups (96.3% yield)
- Boxing

***** [2017-09-13 Wed 10:25] Queso Mama with Sausage
  - Batching (9/14):
    - 3 x 1,366 batches, Fill weight is 32oz
    - Batch #1: 624 cups (91.3%)
    - Batch #2: 656 cups (96.0%)
    - Batch #3: 647 cups (94.7%)
    - Total: 1,927 cups (94.0%)
  - Boxing (9/15,19):
    - 9/15: 51 (35+16 (part of 9/19 numbers)) cases boxed on 9/15. There is more to box.
    - 9/19: 35 (16(from 9/15 pack +19) + 35 +15
    - Total: 120 cases (70% yield) (1,440 cups)
    - We are missing 487 cups!
     
**** HEB Gueso Blanco
***** DONE [2017-09-16 Sat 15:39] HEB Queso Blanco
      CLOSED: [2017-10-13 Fri 15:52]
      - CLOSING NOTE [2017-10-13 Fri 15:52] \\
	Completed
- Batching (9/16)
  - 3 @1,460
  - Batch #1: 1200 cups (61.6% yield)
  - Batch #2: 1560 cups (80.1% yield)
  - Batch #3: 1560 cups (80.1% yield)
- Boxing (9/19,20)
  - Cases (80+35) = 


*** [2017-08-18 Fri 11:20] Jay Alley Queso with Peppers.
- Water conversion was set to 8.3 lb/gal instead of the proper 8 lb/gal
  - This caused us to be short by 3.8 (30.4lb) gallons of water.
  - We were running 2469.7 lb batches insted of 2500.
- On 8/11 we produced 2-2,500 lb batches and 1-1,500 lb batch which is 6,500 total lbs produced.
- With no loss, that would produce 325 20# cases. We produced 302 which is a 92.92% yield.
- Accounting thought we produced 3-2,500 lb batches so the yield is only 80.53%
- Taking into account the water not being added to the kettle our yield would be 93.63%.
**** DONE Update water on Jay Alley Queso with Peppers checklist
     CLOSED: [2017-08-22 Tue 10:02] SCHEDULED: <2017-08-21 Mon>

     - CLOSING NOTE [2017-08-22 Tue 10:02] \\
       Changed gallons to water conversion from 8.3 to 9.0
*** [2017-08-18 Fri 17:03] Champs Apples/FS Apples
    :LOGBOOK:
    CLOCK: [2017-08-22 Tue 09:08]--[2017-08-22 Tue 12:06] =>  2:58
    :END:
- 4 lb bags/4 bags per case = 16lb cases.
- Champs and FS Apples are identical in formula and pack.
- On 8/14, between these two items we had a 98.8% yield. Our target is 95%
- Food Service Apples were overstated in the yield report by 18 cases (971 instead of 953). Yield should be changed from 96.22% to 94.43%.
- If these changes are made the average yield between the two is 98.8% which matches the overall yield for the day for both products.
- I think we are seeing the difference in the changeover from FS to Champs. We may be able to even these types of changeovers with a water push between the changeover.
*** [2017-08-22 Tue 11:49] Soulshine Pizza
    :LOGBOOK:
    CLOCK: [2017-08-22 Tue 14:09]--[2017-08-22 Tue 14:13] =>  0:04
    CLOCK: [2017-08-22 Tue 12:07]--[2017-08-22 Tue 12:34] =>  0:27
    :END:
- 4 lb bags/ 8 bags/case - 32 lb cases.
- Produced 6-2500lb batches = 15,000 lbs of product = 468.75 cases.
- We produced 451 cases = 14432 lbs of product
- Yield is: 96.2%
*** [2017-08-22 Tue 14:14] Cape Cod Chicken Salad
    :LOGBOOK:
    CLOCK: [2017-08-22 Tue 14:14]--[2017-08-22 Tue 15:28] =>  1:14
    :END:
- 8/9 Production
  - 40oz tubs - 12 tubs per case = 30 lb cases
  - Produced 33 500 lb batches on 8/9 = 16,500 lbs of product
  - We produced 534 cases of product = 16,020 lbs of product
  - Yield is: 97.0%
- 8/10 Production
  - Produced 33 500 lb batches on 8/10 = 16,500 lbs of product
  - We produced 534 cases of product = 16,020 lbs of product
  - Yield is: 97.0%
- 8/11 Production
  - Produced 33 50 lb batches plus 1 @ 260 lb on 8/11 = 16,760 lbs of product.
  - Pounds reported on yield is 16,860.
  - Produced 541 cases of product = 16,230 lb of product
  - Yield is: 16,230/16,760 = 96.8%
- Accounting yield used 16,860 instead of 16,760 to calculate the yield. Yield should be adjusted to 96.8%

** Processing Sheets/Raw Material Changes
*** DONE [#B] Update pork raw material number for Jafco Mojo Pork and Champs SV Pork :Processing_Sheets:
    CLOSED: [2017-11-15 Wed 12:08] SCHEDULED: <2017-10-20 Fri>
    - CLOSING NOTE [2017-11-15 Wed 12:08] \\
      Both items were updated on11/15.
*** [2017-10-17 Tue 15:58]
**** CANCELLED Verify Best By Date for Cape Cod Chicken Salad     :CANCELLED:
     CLOSED: [2017-11-21 Tue 22:33] SCHEDULED: <2017-10-18 Wed>
     - State "CANCELLED"  from "TODO"       [2017-11-21 Tue 22:33]
- Formula sheet says 37 days. Pkg line page says 40 days.

*** [2017-09-15 Fri 10:32] Processing Sheet Changes
**** DONE Update HEB Hot Pepper Queso                     :Processing_Sheets:
     CLOSED: [2017-09-18 Mon 16:26] SCHEDULED: <2017-09-15 Fri>
     - CLOSING NOTE [2017-09-18 Mon 16:26] \\
       Processing sheet updated on 9/18
- Increase starch by 2.5 lb per 1740 lb batch

**** DONE Update the Queso Mama Sausage Queso to relect the new lid :Processing_Sheets:
     CLOSED: [2017-09-18 Mon 10:42]
     - CLOSING NOTE [2017-09-18 Mon 10:42] \\
       Completed on Friday 9/15
- Old Lid: 700631 Black Lid
- New Lid: 700656 LID, BERRY, PINK, L410-5; 1000 ct
- Queso Mama Sausage Queso Labeled Containers
  - 702639 CONTAINER, BERRY T41032TCP,CLARIFED, LABELED Q MAMA SAUSAGE: #1487085; 500 ct
    - Replaces 
**** DONE Update HEB Classic Quesso with increased starch. :Processing_Sheets:
     CLOSED: [2017-09-15 Fri 15:37]
     - CLOSING NOTE [2017-09-15 Fri 15:37] \\
       Completed on 9/15.
- Increase starch by 7.2 lb in a 1740 lb batch.

*** [2017-08-08 Tue 16:18] McCormick Seasoning Poultry 700864
**** DONE [#A] Update processing sheets to reflect change from McCormick Poultry Seasoning to Elite Spices :Processing_Sheets:
     CLOSED: [2017-08-09 Wed 16:08] DEADLINE: <2017-08-09 Wed>
     - CLOSING NOTE [2017-08-09 Wed 16:08] \\
       Completed on 8/9/2017. Forwarded to costing as well.
- Old item: 700864 Seasoning, Poultry; McCormick; 12 oz.
- New item: 700964 Seasoning, Poultry, 50#, 34580A2V1, Elite Spices
- Update all formulas

** Daily Production Notes
*** [2017-09-26 Tue 14:50] Champs Mac and Cheese
- Product is too think. Bostwick of around 
*** [2017-09-26 Tue 14:48] HEB Blanco
- Batch #2 was very thick. Product was in spec during initial viscosity check (bostwick was 18 - 20). During prouction run it went up to a 4. Added 20 gallons of water to run properly.
- Reworking 1/2 a cart of batch #2 to batch #3. We had to add 20 gallons to batch #3.

*** [2017-09-09 Sat 15:05] HEB Leaking Queso Cups
**** HEB Classic Queso from Saturday, 9/2 production
- Had 189 leaking tubs. Make sure this gets catured with yield report.

*** [2017-08-29 Tue 08:46]

**** Cryovac 8/28 Costco Chicke Pot Pie
- Slurry #9 not used. Off color from old drippins. Remade slurry with new chicken drippings product.
- Add 200 lb of rework batches 2 - 10.
- Stopped at 10 batches for audit prep.
- Pre-weigh threw away bag of drippings (48 lb)

** Processing Sheet Updates
*** DONE Look into Costco Stuffing and ensure formula is correct.
    CLOSED: [2017-09-07 Thu 14:29] DEADLINE: <2017-09-06 Wed>
    - CLOSING NOTE [2017-09-07 Thu 14:29] \\
      Compled and sent to Mike Buck on 9/7.

** General

*** CANCELLED Look into in-line puree options. Get with Randy.    :CANCELLED:
    CLOSED: [2017-11-15 Wed 10:42] SCHEDULED: <2017-10-17 Tue>
    - State "CANCELLED"  from "WAITING"    [2017-11-15 Wed 10:42] \\
      Canceled by Chris at this time.
    - State "WAITING"    from "TODO"       [2017-10-17 Tue 16:00] \\
      Randy will look into this. I talked to him about this on Monday 10/16.
- Look at Admix and Stephan

*** WAITING Cryovac 1045 Install                                    :WAITING:
    SCHEDULED: <2017-11-24 Fri>

    - State "WAITING"    from "WAITING"    [2017-11-21 Tue 22:33] \\
      Installing on Friday 11/25
*** DONE [#A] Finalize Champs new item processes before 11/15 run
    CLOSED: [2017-11-20 Mon 10:45] DEADLINE: <2017-11-17 Fri>
    - CLOSING NOTE [2017-11-20 Mon 10:45] \\
      compled on 11/18.
    :LOGBOOK:
    CLOCK: [2017-11-17 Fri 11:37]--[2017-11-17 Fri 13:13]
    :END:
- Running new products on 11/15

*** TODO [#B] Look at people asumptions per line or product.
    DEADLINE: <2017-12-01 Fri>

*** TODO [#B] Look at the Downtme Capture Log.
    DEADLINE: <2017-11-03 Fri>
- We're double capturing entries.

*** DONE [#A] Put together prioritized list of deliverables to increase profits.
    CLOSED: [2017-10-25 Wed 19:15] DEADLINE: <2017-10-18 Wed>

    - CLOSING NOTE [2017-10-25 Wed 19:15] \\
      Completed for 10/19 meeting
** Goal Deliverables
   
*** [2017-10-16 Mon 20:02]

- Processing Sheets accuracy
- Continue working with Maintrack
- Product Process Audit for X number of products including PreWeigh
- Define Head Count Efficiencies and/or process alternatives
- Finalize Queso Process
- Batch Cycle Times
